
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 8 to change, 6 to destroy.</code></pre>

* Update
  * module.elastic.azurerm_network_security_rule.aks_rule
  * module.elastic.azurerm_network_security_rule.apps_rule
  * module.elastic.azurerm_network_security_rule.bastion_es_rule[0]
  * module.elastic.azurerm_network_security_rule.jenkins_rule
  * module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0]
  * module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0]
  * module.elastic.azurerm_resource_group.elastic-resourcegroup
  * module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group
* Delete
  * module.elastic2[0].azurerm_resource_group.elastic-resourcegroup
  * module.elastic2[0].azurerm_template_deployment.alert_cluster_health_not_green[0]
  * module.elastic2[0].azurerm_template_deployment.alert_dead_letter_queue[0]
  * module.elastic2[0].azurerm_template_deployment.elastic-iaas
  * module.elastic2[0].random_string.password
  * module.elastic2[0].module.elastic_action_group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.elastic.data.azurerm_application_security_group.data_asg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "data_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-data-asg"
      + resource_group_name = "ccd-elastic-search-aat"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_application_security_group.kibana_asg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "kibana_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-asg"
      + resource_group_name = "ccd-elastic-search-aat"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.cluster_nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "cluster_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-cluster-nsg"
      + resource_group_name = "ccd-elastic-search-aat"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.kibana_nsg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "kibana_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-nsg"
      + resource_group_name = "ccd-elastic-search-aat"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.azurerm_network_security_rule.aks_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "aks_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/AKS_To_ES"
        name                                       = "AKS_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.apps_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "apps_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/App_To_ES"
        name                                       = "App_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.bastion_es_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "bastion_es_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Bastion_To_ES"
        name                                       = "Bastion_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.jenkins_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "jenkins_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Jenkins_To_ES"
        name                                       = "Jenkins_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_kibana_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_Kibana"
        name                                       = "Bastion_only_Kibana"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_ssh_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_SSH"
        name                                       = "Bastion_only_SSH"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_resource_group.elastic-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "elastic-resourcegroup" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat"
        name       = "ccd-elastic-search-aat"
      ~ tags       = {
          - "application"         = "core-case-data"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ccd-community"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-05-17T15:23:08Z"
          - "managedBy"           = "CCD"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.elastic2[0].azurerm_resource_group.elastic-resourcegroup will be destroyed
  # (because azurerm_resource_group.elastic-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "elastic-resourcegroup" {
      - id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-17635-elastic-search-aat" -> null
      - location   = "uksouth" -> null
      - name       = "ccd-17635-elastic-search-aat" -> null
      - tags       = {
          - "application"         = "core-case-data"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ccd-community"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-05-17T15:23:08Z"
          - "managedBy"           = "CCD"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.elastic2[0].azurerm_template_deployment.alert_cluster_health_not_green[0] will be destroyed
  # (because azurerm_template_deployment.alert_cluster_health_not_green is not in configuration)
  - resource "azurerm_template_deployment" "alert_cluster_health_not_green" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/ccd-17635_alert_cluster_health_not_green_aat" -> null
      - name                = "ccd-17635_alert_cluster_health_not_green_aat" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "ActionGroupName"        = "ccd-17635_ElasticSearch_aat"
          - "AggregateValue"         = "0"
          - "AggregateValueOperator" = "gt"
          - "AlertFrequency"         = "5"
          - "Description"            = "Checks that status_s for the healthcheck is != green on aat"
          - "DisplayNameOfSearch"    = "ccd-17635 Cluster health is not green on aat"
          - "SearchQuery"            = "es_health_CL | where (status_s != \"green\" or error_type_s != \"\" ) and cluster_s == \"ccd-17635-elastic-search-aat\""
          - "Severity"               = "warning"
          - "TimeWindow"             = "10"
          - "TriggerAlertCondition"  = "Total"
          - "TriggerAlertOperator"   = "gt"
          - "TriggerAlertValue"      = "0"
          - "UniqueNameOfSearch"     = "Cluster-unhealthy-aat"
          - "workspaceName"          = "hmcts-nonprod"
        } -> null
      - resource_group_name = "oms-automation" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0"
              - outputs        = {}
              - parameters     = {
                  - ActionGroupName        = {
                      - defaultValue = "my-ation-group"
                      - metadata     = {
                          - Description = "Action group for alert actions"
                        }
                      - type         = "string"
                    }
                  - AggregateValue         = {
                      - defaultValue = "70"
                      - metadata     = {
                          - Description = "The value to compare the results (0-10000)"
                        }
                      - type         = "string"
                    }
                  - AggregateValueOperator = {
                      - allowedValues = [
                          - "gt",
                          - "lt",
                        ]
                      - defaultValue  = "gt"
                      - metadata      = {
                          - Description = "gt = greater than or lt = less than"
                        }
                      - type          = "string"
                    }
                  - AlertFrequency         = {
                      - defaultValue = "5"
                      - metadata     = {
                          - Description = "How often the query runs in minutes. (5-1440)"
                        }
                      - type         = "string"
                    }
                  - Description            = {
                      - defaultValue = "Description"
                      - metadata     = {
                          - Description = "Unique Name Of Search. Please dont use special characters"
                        }
                      - type         = "string"
                    }
                  - DisplayNameOfSearch    = {
                      - defaultValue = "Memory Utilization % > 90% Over 5 minutes"
                      - metadata     = {
                          - Description = "Name of search query"
                        }
                      - type         = "string"
                    }
                  - SearchCategory         = {
                      - defaultValue = "ElasticSearch"
                      - metadata     = {
                          - Description = "Search Category"
                        }
                      - type         = "string"
                    }
                  - SearchQuery            = {
                      - defaultValue = "Perf | where ObjectName == \"Memory\" | where CounterName == \"% Committed Bytes In Use\" | summarize AggregatedValue = avg(CounterValue) by Computer, bin(TimeGenerated, 5min)"
                      - metadata     = {
                          - Description = "SearchQuery. Please remember to use '' in powershell or escape character \" from ARM"
                        }
                      - type         = "string"
                    }
                  - Severity               = {
                      - allowedValues = [
                          - "critical",
                          - "warning",
                          - "informational",
                        ]
                      - defaultValue  = "warning"
                      - metadata      = {
                          - Description = "Severity of alert"
                        }
                      - type          = "string"
                    }
                  - ThrottleDuration       = {
                      - defaultValue = "30"
                      - metadata     = {
                          - Description = "Number of minutes to suppress alerts after one from the same alert rule is created."
                        }
                      - type         = "string"
                    }
                  - TimeWindow             = {
                      - defaultValue = "10"
                      - metadata     = {
                          - Description = "Length of time in minutes over which to evaluate results. Must be greater than or equal to AlertFrequency (5-1440)"
                        }
                      - type         = "string"
                    }
                  - TriggerAlertCondition  = {
                      - allowedValues = [
                          - "Total",
                          - "Consecutive",
                        ]
                      - defaultValue  = "Total"
                      - metadata      = {
                          - Description = "Total or Consecutive"
                        }
                      - type          = "string"
                    }
                  - TriggerAlertOperator   = {
                      - allowedValues = [
                          - "gt",
                          - "eq",
                        ]
                      - defaultValue  = "gt"
                      - metadata      = {
                          - Description = "gt = greater than or eq = equal to"
                        }
                      - type          = "string"
                    }
                  - TriggerAlertValue      = {
                      - defaultValue = "0"
                      - metadata     = {
                          - Description = "Number of the times the criteria must be met to trigger the alert. (0-10000)"
                        }
                      - type         = "string"
                    }
                  - UniqueNameOfSearch     = {
                      - defaultValue = "Memory-Utilization-90"
                      - metadata     = {
                          - Description = "Unique Name Of Search. Please dont use special characters"
                        }
                      - type         = "string"
                    }
                  - workspaceName          = {
                      - metadata = {
                          - Description = "Name of Log Analytics workspace"
                        }
                      - type     = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "[variables('LogAnalyticsApiVersion')]"
                      - dependsOn  = []
                      - name       = "[concat(parameters('workspaceName'), '/', parameters('UniqueNameOfSearch'))]"
                      - properties = {
                          - category    = "[parameters('SearchCategory')]"
                          - displayName = "[parameters('DisplayNameOfSearch')]"
                          - etag        = "*"
                          - query       = "[parameters('SearchQuery')]"
                        }
                      - tags       = {}
                      - type       = "Microsoft.OperationalInsights/workspaces/savedSearches"
                    },
                  - {
                      - apiVersion = "[variables('LogAnalyticsApiVersion')]"
                      - dependsOn  = [
                          - "[concat('Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'), '/savedSearches/', parameters('UniqueNameOfSearch'))]",
                        ]
                      - name       = "[concat(parameters('workspaceName'), '/', parameters('UniqueNameOfSearch'), '/', variables('ScheduleName'))]"
                      - properties = {
                          - Enabled       = true
                          - Interval      = "[parameters('AlertFrequency')]"
                          - QueryTimeSpan = "[parameters('TimeWindow')]"
                          - etag          = "*"
                        }
                      - type       = "Microsoft.OperationalInsights/workspaces/savedSearches/schedules/"
                    },
                  - {
                      - apiVersion = "[variables('LogAnalyticsApiVersion')]"
                      - dependsOn  = [
                          - "[concat('Microsoft.OperationalInsights/workspaces/', parameters('workspaceName'), '/savedSearches/', parameters('UniqueNameOfSearch'), '/schedules/', variables('ScheduleName'))]",
                        ]
                      - name       = "[concat(parameters('workspaceName'), '/', parameters('UniqueNameOfSearch'), '/', variables('ScheduleName'), '/', variables('AlertName'))]"
                      - properties = {
                          - AzNsNotification = {
                              - CustomEmailSubject = "[parameters('DisplayNameOfSearch')]"
                              - GroupIds           = [
                                  - "[resourceId('Microsoft.Insights/actionGroups', parameters('ActionGroupName'))]",
                                ]
                            }
                          - Description      = "[parameters('Description')]"
                          - Name             = "[parameters('DisplayNameOfSearch')]"
                          - Severity         = "[parameters('Severity')]"
                          - Threshold        = {
                              - Operator = "[parameters('AggregateValueOperator')]"
                              - Value    = "[parameters('AggregateValue')]"
                            }
                          - Throttling       = {
                              - DurationInMinutes = "[parameters('ThrottleDuration')]"
                            }
                          - Type             = "Alert"
                          - etag             = "*"
                        }
                      - type       = "Microsoft.OperationalInsights/workspaces/savedSearches/schedules/actions"
                    },
                ]
              - 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

    - Standard_M128s    = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M16ms    = {
                          - dataDisks          = 16
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M32ls    = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M32ms    = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M32ts    = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64      = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64ls    = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64m     = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64ms    = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64s     = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M8ms     = {
                          - dataDisks          = 8
                          - storageAccountType = "Premium_LRS"
                        }
                    }
                  - esSettings                       = {
                      - clusterName                 = "[parameters('esClusterName')]"
                      - heapSize                    = "[parameters('esHeapSize')]"
                      - httpCaCertBlob              = "[parameters('esHttpCaCertBlob')]"
                      - httpCaCertPassword          = "[parameters('esHttpCaCertPassword')]"
                      - httpCertBlob                = "[parameters('esHttpCertBlob')]"
                      - httpCertPassword            = "[parameters('esHttpCertPassword')]"
                      - installAdditionalPlugins    = "[parameters('esAdditionalPlugins')]"
                      - installPlugins              = "[parameters('xpackPlugins')]"
                      - samlMetadataUri             = "[parameters('samlMetadataUri')]"
                      - samlServiceProviderUri      = "[parameters('samlServiceProviderUri')]"
                      - securityAdminPwd            = "[parameters('securityAdminPassword')]"
                      - securityApmPwd              = "[parameters('securityApmPassword')]"
                      - securityBeatsPwd            = "[parameters('securityBeatsPassword')]"
                      - securityBootstrapPwd        = "[if(not(empty(parameters('securityBootstrapPassword'))),parameters('securityBootstrapPassword'),uniqueString(resourceGroup().id, deployment().name, parameters('securityAdminPassword')))]"
                      - securityKibanaPwd           = "[parameters('securityKibanaPassword')]"
                      - securityLogstashPwd         = "[parameters('securityLogstashPassword')]"
                      - securityRemoteMonitoringPwd = "[parameters('securityRemoteMonitoringPassword')]"
                      - transportCaCertBlob         = "[parameters('esTransportCaCertBlob')]"
                      - transportCaCertPassword     = "[parameters('esTransportCaCertPassword')]"
                      - transportCertPassword       = "[parameters('esTransportCertPassword')]"
                      - version                     = "[parameters('esVersion')]"
                      - yamlConfiguration           = "[parameters('esAdditionalYaml')]"
                    }
                  - esVersionMajor                   = "[int(split(parameters('esVersion'), '.')[0])]"
                  - esVersionMinor                   = "[int(split(parameters('esVersion'), '.')[1])]"
                  - kibanaHttps                      = "[if(and(greater(length(parameters('kibanaKeyBlob')), 0), greater(length(parameters('kibanaCertBlob')), 0)), 'Yes', 'No')]"
                  - kibanaIpTemplateUrl              = "[uri(parameters('_artifactsLocation'), concat(variables('kibanaIpTemplates')[variables('topologySettings').kibana], parameters('_artifactsLocationSasToken')))]"
                  - kibanaIpTemplates                = {
                      - No  = "empty/empty-kibana-ip-resources.json"
                      - Yes = "empty/empty-kibana-ip-resources.json"
                    }
                  - lbBackEndPoolsAdded              = {
                      - backendPools = "[variables('backendPoolConfigurations')[parameters('loadBalancerType')]]"
                    }
                  - lbBackendPoolsRemoved            = {
                      - backendPools = []
                    }
                  - loadBalancerOptions              = {
                      - external = "external-lb-resources"
                      - gateway  = "[concat(toLower(parameters('appGatewayTier')),'-application-gateway-resources')]"
                      - internal = "internal-lb-resources"
                    }
                  - loadBalancerTemplateUrl          = "[uri(parameters('_artifactsLocation'), concat('loadbalancers/', variables('loadBalancerOptions')[parameters('loadBalancerType')],'.json', parameters('_artifactsLocationSasToken')))]"
                  - location                         = "[parameters('location')]"
                  - networkResourceGroupMap          = {
                      - existing = "[parameters('vNetExistingResourceGroup')]"
                      - new      = "[resourceGroup().name]"
                    }
                  - networkSettings                  = {
                      - addressPrefix            = "[parameters('vNetNewAddressPrefix')]"
                      - applicationGatewaySubnet = {
                          - addressPrefix = "[parameters('vNetNewAppGatewaySubnetAddressPrefix')]"
                          - name          = "[parameters('vNetAppGatewaySubnetName')]"
                        }
                      - externalSku              = "[parameters('loadBalancerExternalSku')]"
                      - https                    = "[if(and(or(greater(length(parameters('esHttpCertBlob')), 0), greater(length(parameters('esHttpCaCertBlob')), 0)), or(equals(parameters('xpackPlugins'), 'Yes'), and(greaterOrEquals(variables('esVersionMajor'), 7), greaterOrEquals(variables('esVersionMinor'), 1)), and(equals(variables('esVersionMajor'), 6), greaterOrEquals(variables('esVersionMinor'), 8)))), 'Yes', 'No')]"
                      - internalSku              = "[parameters('loadBalancerInternalSku')]"
                      - location                 = "[variables('location')]"
                      - name                     = "[parameters('vNetName')]"
                      - namespacePrefix          = "[parameters('vmHostNamePrefix')]"
                      - resourceGroup            = "[variables('networkResourceGroupMap')[parameters('vNetNewOrExisting')]]"
                      - subnet                   = {
                          - addressPrefix  = "[parameters('vNetNewClusterSubnetAddressPrefix')]"
                          - loadbalancerIp = "[variables('vNetLoadBalancerIp')]"
                          - name           = "[parameters('vNetClusterSubnetName')]"
                        }
                    }
                  - networkTemplateUrl               = "[uri(parameters('_artifactsLocation'), concat('networks/virtual-network-resources.json', parameters('_artifactsLocationSasToken')))]"
                  - newSubNetFirstAvailableAddress   = "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 4)))]"
                  - newSubNetReservedStartAddresses  = [
                      - "[variables('newSubNetStartAddress')]",
                      - "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 1)))]",
                      - "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 2)))]",
                      - "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 3)))]",
                    ]
                  - newSubNetStartAddress            = "[if(equals('new', parameters('vNetNewOrExisting')), first(split(parameters('vNetNewClusterSubnetAddressPrefix'), '/')), '')]"
                  - newSubNetStartAddressFirstOctets = "[if(equals('new', parameters('vNetNewOrExisting')), substring(variables('newSubNetStartAddress'), 0, lastIndexOf(variables('newSubNetStartAddress'), '.')), '')]"
                  - newSubNetStartAddressLastOctet   = "[if(equals('new', parameters('vNetNewOrExisting')), int(last(split(variables('newSubNetStartAddress'), '.'))), 0)]"
                  - osSettingsTemplateUrl            = "[uri(parameters('_artifactsLocation'), concat('settings/ubuntuSettings.json', parameters('_artifactsLocationSasToken')))]"
                  - resolvedDataDiskCount            = "[min(variables('dataDiskOptions'))]"
                  - resolvedStorageAccountType       = "[variables('storageAccountOverrides')[parameters('storageAccountType')]]"
                  - sharedTemplateUrl                = "[uri(parameters('_artifactsLocation'), concat('partials/shared-resources.json', parameters('_artifactsLocationSasToken')))]"
                  - storageAccountOverrides          = {
                      - Default  = "[variables('dataSkuSettings')[parameters('vmSizeDataNodes')].storageAccountType]"
                      - Standard = "StandardSSD_LRS"
                    }
                  - tmpVmSizeDataDisks               = "[variables('dataSkuSettings')[parameters('vmSizeDataNodes')].dataDisks]"
                  - topologySettings                 = {
                      - dataLoadBalancerBackEndPools      = "[variables('dataLoadBalancerOptions')[variables('clientResourceIndex')].backendPools]"
                      - dataNodeStorageSettings           = {
                          - accountType     = "[variables('resolvedStorageAccountType')]"
                          - dataAccountType = "[variables('dataResolvedStorageAccountType')]"
                          - dataDisks       = "[variables('resolvedDataDiskCount')]"
                          - diskSize        = "[variables('dataDiskSizes')[parameters('vmDataDiskSize')]]"
                        }
                      - dataNodesAreMasterEligible        = "[parameters('dataNodesAreMasterEligible')]"
                      - jumpbox                           = "[parameters('jumpbox')]"
                      - kibana                            = "[parameters('kibana')]"
                      - kibanaCertBlob                    = "[parameters('kibanaCertBlob')]"
                      - kibanaHttps                       = "[variables('kibanaHttps')]"
                      - kibanaKeyBlob                     = "[parameters('kibanaKeyBlob')]"
                      - kibanaKeyPassphrase               = "[parameters('kibanaKeyPassphrase')]"
                      - kibanaYaml                        = "[parameters('kibanaAdditionalYaml')]"
                      - loadBalancerBackEndPools          = "[variables('lbBackEndPoolsAdded').backendPools]"
                      - logstash                          = "[parameters('logstash')]"
                      - logstashConf                      = "[parameters('logstashConf')]"
                      - logstashHeapSize                  = "[parameters('logstashHeapSize')]"
                      - logstashKeystorePwd               = "[if(not(empty(parameters('logstashKeystorePassword'))),parameters('logstashKeystorePassword'),uniqueString(resourceGroup().id, deployment().name, parameters('securityLogstashPassword')))]"
                      - logstashPlugins                   = "[parameters('logstashAdditionalPlugins')]"
                      - logstashYaml                      = "[parameters('logstashAdditionalYaml')]"
                      - vNetLoadBalancerIp                = "[variables('vNetLoadBalancerIp')]"
                      - vmClientNodeAcceleratedNetworking = "[parameters('vmClientNodeAcceleratedNetworking')]"
                      - vmClientNodeCount                 = "[parameters('vmClientNodeCount')]"
                      - vmDataNodeAcceleratedNetworking   = "[parameters('vmDataNodeAcceleratedNetworking')]"
                      - vmDataNodeCount                   = "[parameters('vmDataNodeCount')]"
                      - vmDataNodeStorageAccountType      = "[variables('dataSkuSettings')[parameters('vmSizeDataNodes')].storageAccountType]"
                      - vmHostNamePrefix                  = "[parameters('vmHostNamePrefix')]"
                      - vmKibanaAcceleratedNetworking     = "[parameters('vmKibanaAcceleratedNetworking')]"
                      - vmLogstashAcceleratedNetworking   = "[parameters('vmLogstashAcceleratedNetworking')]"
                      - vmLogstashCount                   = "[parameters('vmLogstashCount')]"
                      - vmMasterNodeAcceleratedNetworking = "[parameters('vmMasterNodeAcceleratedNetworking')]"
                      - vmSizeClientNodes                 = "[parameters('vmSizeClientNodes')]"
                      - vmSizeDataNodes                   = "[parameters('vmSizeDataNodes')]"
                      - vmSizeKibana                      = "[parameters('vmSizeKibana')]"
                      - vmSizeLogstash                    = "[parameters('vmSizeLogstash')]"
                      - vmSizeMasterNodes                 = "[parameters('vmSizeMasterNodes')]"
                    }
                  - vNetLoadBalancerIp               = "[if(equals('existing', parameters('vNetNewOrExisting')), parameters('vNetLoadBalancerIp'), if(contains(variables('newSubNetReservedStartAddresses'), parameters('vNetLoadBalancerIp')), variables('newSubNetFirstAvailableAddress'), parameters('vNetLoadBalancerIp')))]"
                }
            }
        ) -> null
    }

  # module.elastic2[0].random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "vWJ3pdAEaJIm6rAX" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "vWJ3pdAEaJIm6rAX" -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd"
        name                     = "es-ccd"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.elastic2[0].module.elastic_action_group.azurerm_resource_group_template_deployment.action-group will be destroyed
  # (because azurerm_resource_group_template_deployment.action-group is not in configuration)
  - resource "azurerm_resource_group_template_deployment" "action-group" {
      - deployment_mode          = "Incremental" -> null
      - id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd-17635" -> null
      - name                     = "es-ccd-17635" -> null
      - output_content           = jsonencode({})
      - parameters_content       = (sensitive value) -> null
      - resource_group_name      = "oms-automation" -> null
      - tags                     = {} -> null
      - template_content         = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName      = {
                      - type = "String"
                    }
                  - emailReceiverAddress = {
                      - metadata = {
                          - description = "Email address of the receiver"
                        }
                      - type     = "String"
                    }
                  - emailReceiverName    = {
                      - metadata = {
                          - description = "Name of the email receiver"
                        }
                      - type     = "String"
                    }
                  - location             = {
                      - defaultValue = "global"
                      - type         = "String"
                    }
                  - shortName            = {
                      - type = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-04-01"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('actionGroupName')]"
                      - properties = {
                          - emailReceivers   = [
                              - {
                                  - emailAddress = "[parameters('emailReceiverAddress')]"
                                  - name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          - enabled          = true
                          - groupShortName   = "[parameters('shortName')]"
                          - smsReceivers     = []
                          - webhookReceivers = []
                        }
                      - tags       = {}
                      - type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        ) -> null
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":78,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->